#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<locale.h>

int main()
{
	setlocale(LC_ALL, "rus");

	char shv1[10], shv2[10], shv3[10], shv4[10], shv5[10], shv6[10];
	int sc1, sc2, sc3, sc4, sc5, sc6;


	printf("1. Введите: Наименование, производитель, кол-во сост. частей, цена ($) >");
	scanf("%s %s %d %d", shv1, shv4, &sc1, &sc4);
	printf("2. Введите: Наименование, производитель, кол-во сост. частей, цена ($) >");
	scanf("%s %s %d %d", shv2, shv5, &sc2, &sc5);

	printf("3.Введите: Наименование, производитель, кол-во сост. частей, цена ($) >");
	scanf("%s %s %d %d", shv3, shv6, &sc3, &sc6);

	printf("|---------------------------------------------------------------------------|\n");
	printf("| Офисные пакеты                                                            |\n");
	printf("|---------------------------------------------------------------------------|\n");
	printf("| Наименование  |Производитель| кол-во сост. частей |    цена ($)           |\n");
	printf("|---------------|-------------|---------------------|-----------------------|\n");
	printf("|%15s|%13s|   %5d             | %8d              |\n", shv1, shv4, sc1, sc4);
	printf("|%15s|%13s|   %5d             | %8d              |\n", shv2, shv5, sc2, sc5);
	printf("|%15s|%13s|   %5d             | %8d              |\n", shv3, shv6, sc3, sc6);
	printf("|---------------------------------------------------------------------------|\n");
	printf("| Примечание: Возможно бесплатно получить продукт StarOffice через интернет |\n");
	printf("|---------------------------------------------------------------------------|\n");
	return 0;
}